configuration/src/Catalogs/Филиалы/Филиалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Филиалы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>КастомныеКоманды</name>
      <description>Кастомные команды</description>
    </items>
  </predefined>
  <attributes>
    <name>ITСтруктура</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаместительРуководителя</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Территория</name>
    <type>
      <types>CatalogRef.Территории</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФилиала</name>
    <type>
      <types>EnumRef.ТипыФилиалов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленВИсточнике</name>
    <comment>Устанавливается в Истину, если обменом пришло Удаление объекта.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОбщийКаналRocketChat</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеЛицо</name>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИерархияТерриторий</name>
    <attributes>
      <name>Территория</name>
      <type>
        <types>CatalogRef.Территории</types>
      </type>
    </attributes>
    <attributes>
      <name>Уровень</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазрабатываемыеСистемы</name>
    <attributes>
      <name>Система</name>
      <type>
        <types>CatalogRef.СистемыУчета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/InformationRegisters/СвязанныеОбъекты/СвязанныеОбъекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязанныеОбъекты</name>
  <resources>
    <name>РассчитыватьМетрикиСИсточником</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИсточникСвязи</name>
    <type>
      <types>CatalogRef.Филиалы</types>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.Задача</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСвязи</name>
    <type>
      <types>EnumRef.ВидыСвязейОбъектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПриемникСвязи</name>
    <type>
      <types>CatalogRef.Филиалы</types>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.Задача</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ПорядокЭтаповКанбана/ПорядокЭтаповКанбана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПорядокЭтаповКанбана</name>
  <resources>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.ЭтапыКанбана</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/ТипыФилиалов/ТипыФилиалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыФилиалов</name>
  <enumValues>
    <name>IT</name>
  </enumValues>
  <enumValues>
    <name>НеIT</name>
  </enumValues>
  <enumValues>
    <name>QA</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Enums/ВидыСвязейОбъектов/ВидыСвязейОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСвязейОбъектов</name>
  <enumValues>
    <name>СвязанаС</name>
  </enumValues>
  <enumValues>
    <name>Дублирует</name>
  </enumValues>
  <enumValues>
    <name>Дублируется</name>
  </enumValues>
  <enumValues>
    <name>Блокирует</name>
  </enumValues>
  <enumValues>
    <name>Блокируется</name>
  </enumValues>
  <enumValues>
    <name>Следующая</name>
  </enumValues>
  <enumValues>
    <name>Предыдущая</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Catalogs/ГруппыДоступа/ГруппыДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыДоступа</name>
  <predefined>
    <items>
      <name>ЗаместителиРуководителейФилиалов</name>
      <description>Заместители руководителей филиалов</description>
    </items>
    <items>
      <name>ЗаместителиРуководителейФилиаловIT</name>
      <description>Заместители руководителей филиалов IT</description>
    </items>
    <items>
      <name>ИзменениеНастроекФилиала</name>
      <description>Изменение настроек филиала</description>
    </items>
    <items>
      <name>ИзменениеНастроекЭскалацииОшибок</name>
      <description>Изменение настроек эскалации ошибок</description>
    </items>
    <items>
      <name>ИспользованиеГабаритногоПланирования</name>
      <description>Использование габаритного планирования</description>
    </items>
    <items>
      <name>ИспользованиеГрупповогоВнесенияТрудозатрат</name>
      <description>Использование группового внесения трудозатрат</description>
    </items>
    <items>
      <name>ОтветственныеЗаИзменениеСпискаПродуктов</name>
      <description>Ответственные за изменение списка продуктов</description>
    </items>
    <items>
      <name>ОтветственныеЗаИзменениеЮридическогоЛицаВЗаявках</name>
      <description>Ответственные за изменение юридического лица в заявках</description>
    </items>
    <items>
      <name>ОтветственныеЗаНазначениеЗаявокНаправленияРозничныеПроцессы</name>
      <description>Ответственные за назначение заявок направления розничные процессы</description>
    </items>
    <items>
      <name>ОтветственныеЗаРедактированиеГруппЗаказчиков</name>
      <description>Ответственные за редактирование групп заказчиков</description>
    </items>
    <items>
      <name>ОтветственныеЗаРедактированиеМотивационныхПрофилей</name>
      <description>Ответственные за редактирование мотивационных профилей</description>
    </items>
    <items>
      <name>ОтветственныеЗаСозданиеИИзменениеДокументовУслугиСтороннейОрганизации</name>
      <description>Ответственные за создание и изменение документов услуги сторонней организации</description>
    </items>
    <items>
      <name>РуководителиКомандИСтаршиеПрограммисты</name>
      <description>Руководители команд и старшие программисты</description>
    </items>
    <items>
      <name>РуководителиФилиалов</name>
      <description>Руководители филиалов</description>
    </items>
    <items>
      <name>РуководителиФилиаловIT</name>
      <description>Руководители филиалов IT</description>
    </items>
    <items>
      <name>СозданиеКастомныхКоманд</name>
      <description>Создание кастомных команд</description>
    </items>
    <items>
      <name>СТОиРуководителиITНаправлений</name>
      <description>СТО и руководители IT направлений</description>
    </items>
  </predefined>
  <tabularSections>
    <name>РолиКонфигурации</name>
    <attributes>
      <name>Роль</name>
      <comment>Роли только с признаком ЭтоРольКонфигурации</comment>
      <type>
        <types>CatalogRef.ПрограммныеРоли</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.Должности</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.Филиалы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/Филиалы/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ТолстыйКлиент ИЛИ ВнешнееСоединение Тогда

#Область ОбъявлениеПеременных

// Хранит состояние объекта до записи
Перем ДанныеДоЗаписи;

// Хранит описание изменений объекта
Перем ОписаниеИзменений;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		ОбщегоНазначения.ОчисткаДублейТабличнойЧасти(РазрабатываемыеСистемы, "Система");
	КонецЕсли;
	
	ОписаниеИзменений = ОбщегоНазначения.ПолучитьСостояниеОбъектаДоЗаписи(Ссылка);
	
	ДанныеДоЗаписи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, 
		"Руководитель, ЗаместительРуководителя, ЮридическоеЛицо, ПометкаУдаления");
	
	ЯвляетсяИТОрганизацией = ЗначениеЗаполнено(ЮридическоеЛицо) 
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЮридическоеЛицо, "ЯвляетсяИТОрганизацией");

	ДанныеДоЗаписи.Вставить("ЯвляетсяИТОрганизацией"); 
	ДанныеДоЗаписи.ЯвляетсяИТОрганизацией = (ЗначениеЗаполнено(ДанныеДоЗаписи.ЮридическоеЛицо)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДоЗаписи.ЮридическоеЛицо, "ЯвляетсяИТОрганизацией"));
	
	Если ЭтоНовый() ИЛИ ЯвляетсяИТОрганизацией <> ДанныеДоЗаписи.ЯвляетсяИТОрганизацией Тогда
		ТипФилиала = ?(ЯвляетсяИТОрганизацией, Перечисления.ТипыФилиалов.IT, Перечисления.ТипыФилиалов.НеIT);
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЯвляетсяИТОрганизацией", ЯвляетсяИТОрганизацией);

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Сравнение состояния до и после записи
	ОбщегоНазначения.ОбработатьИзменениеОбъекта(Ссылка, ОписаниеИзменений);
	
	Если ДополнительныеСвойства.Свойство("СвязанныеФилиалы") Тогда
		Для Каждого СтрокаМассива Из ДополнительныеСвойства.СвязанныеФилиалы.ДобавитьИзменить Цикл
			РегистрыСведений.СвязанныеОбъекты.ДобавитьДвойнуюСвязь(Ссылка, СтрокаМассива.Филиал, 
				Перечисления.ВидыСвязейОбъектов.СвязанаС, СтрокаМассива.РассчитыватьМетрикиСИсточником);
		КонецЦикла;
		Для Каждого СтрокаМассива Из ДополнительныеСвойства.СвязанныеФилиалы.Удалить Цикл
			РегистрыСведений.СвязанныеОбъекты.УдалитьДвойнуюСвязь(Ссылка, СтрокаМассива.Филиал, 
				Перечисления.ВидыСвязейОбъектов.СвязанаС);
		КонецЦикла;
	КонецЕсли;
	
	ИзменилсяРуководитель = (ДанныеДоЗаписи.Руководитель <> Руководитель);
	ИзмениласьПометкаУдаления = (ДанныеДоЗаписи.ПометкаУдаления <> ПометкаУдаления);
	
	Если Родитель = Справочники.Филиалы.ПустаяСсылка() Тогда	
		ИзменилсяЗаместитель = (ДанныеДоЗаписи.ЗаместительРуководителя <> ЗаместительРуководителя);
		
		ЭтоФилиалИТОрганизации = РаботаСНастройкамиВызовСервера.ЭтоФилиалИТОрганизации(Ссылка);
			
		// Группы доступа	
		Если ИзменилсяРуководитель Тогда
			ОбработатьИзменениеРуководителя(Справочники.ГруппыДоступа.РуководителиФилиалов, 
				Руководитель, ДанныеДоЗаписи.Руководитель, "Руководитель");
			
			Если ЭтоФилиалИТОрганизации Тогда
				ОбработатьИзменениеРуководителя(Справочники.ГруппыДоступа.РуководителиФилиаловIT, 
					Руководитель, ДанныеДоЗаписи.Руководитель, "Руководитель", Истина); 
			КонецЕсли;
		КонецЕсли;
		
		Если ИзменилсяЗаместитель Тогда
			ОбработатьИзменениеРуководителя(Справочники.ГруппыДоступа.ЗаместителиРуководителейФилиалов, 
				ЗаместительРуководителя, ДанныеДоЗаписи.ЗаместительРуководителя, "ЗаместительРуководителя");
			
			Если ЭтоФилиалИТОрганизации Тогда
				ОбработатьИзменениеРуководителя(Справочники.ГруппыДоступа.ЗаместителиРуководителейФилиаловIT, 
					ЗаместительРуководителя, ДанныеДоЗаписи.ЗаместительРуководителя, "ЗаместительРуководителя", Истина);
			КонецЕсли;
		КонецЕсли;
	Иначе
		НовыйРуководитель = Руководитель;
		СтарыйРуководитель = ДанныеДоЗаписи.Руководитель;

		Если ПометкаУдаления Тогда
			НовыйРуководитель = Справочники.Пользователи.ПустаяСсылка();
		ИначеЕсли НЕ ИзменилсяРуководитель Тогда 
			СтарыйРуководитель = Справочники.Пользователи.ПустаяСсылка();
		КонецЕсли;
		
		// Руководители команд
		Если ИзменилсяРуководитель ИЛИ ИзмениласьПометкаУдаления Тогда
			ОбработатьИзменениеРуководителя(Справочники.ГруппыДоступа.РуководителиКомандИСтаршиеПрограммисты, 
				НовыйРуководитель, СтарыйРуководитель, "РуководительКоманды");
		КонецЕсли;
	КонецЕсли;
	
	ИзмениласьПринадлежностьКIT = ДополнительныеСвойства.ЯвляетсяИТОрганизацией <> ДанныеДоЗаписи.ЯвляетсяИТОрганизацией;
	
	// Обработка изменения принадлежности филиала к IT-организации  
	Если ДанныеДоЗаписи.ЮридическоеЛицо <> ЮридическоеЛицо И ИзмениласьПринадлежностьКIT Тогда		
		Справочники.Филиалы.ОбработатьИзменениеЮридическогоЛица(Ссылка, ДополнительныеСвойства.ЯвляетсяИТОрганизацией);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Родитель) И (ИзмениласьПринадлежностьКIT ИЛИ ИзмениласьПометкаУдаления) Тогда		
		РегистрыСведений.ПорядокЭтаповКанбана.ИзменитьЗаписи(Ссылка, ТипФилиала, ПометкаУдаления);
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьИзменениеРуководителя(Знач ГруппаДоступа, Знач Пользователь, Знач ПользовательДоЗаписи, Знач ПолеИзменения, Знач ТолькоИТФилиалы = Ложь)
	
	Справочники.ГруппыДоступа.ДобавитьРуководителя(ГруппаДоступа, Пользователь);
	
	Справочники.ГруппыДоступа.УдалитьРуководителя(Ссылка, ГруппаДоступа, 
		ПользовательДоЗаписи, ПолеИзменения, ТолькоИТФилиалы);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
